package study.ifSwitch.Problem;

public class Application01 {
    /* 문제. 1.
     *  아래 예시와 같이 메뉴를 출력하고 메뉴 번호를 누르면 "OO메뉴입니다"를, 종료 번호를 누르면 "프로그램이 종료됩니다." 를 출력하시오.
     *
     * 예시.
     *  1. 입력
     *  2. 수정
     *  3. 조회
     *  4. 삭제
     *  7. 종료
     *  메뉴 번호를 입력하세요 : 3
     *  조회 메뉴입니다.
     */

    /* 문제. 2.
     *  키, 몸무게를 double로 입력 받고 BMI지수를 계산하여 계산 결과에 따라 저체중/정상체중/과체중/비만을 출력하세요
     *  BMI = 몸무게 / (키(m) * 키(m))
     *  BMI가 18.5 미만일 경우 저체중 / 18.5이상 23미만일 경우 정상체중
     *  BMI가 23이상 25미만일 경우 과체중 / 25이상 30미만일 경우 비만
     *  BMI가 30이상일 경우 고도 비만
     * 예시.
     *  키(m)를 입력해 주세요 : 1.65
     *  몸무게(kg)를 입력해 주세요 : 58.4
     *  BMI 지수 : 21.45087235996327
     *  정상체중
     */

    /* 문제. 3.
     *  중간고사, 기말고사, 과제점수, 출석횟수를 입력하고 Pass 또는 Fail을 출력하세요.
     *  평가 비율은 중간고사 20%, 기말고사 30%, 과제 30%, 출석 20%로 이루어져 있고 이 때,
     *  출석 비율은 출석 횟수의 총 강의 횟수 20회 중에서 출석한 날만 따진 값으로 계산하세요.
     *  70점 이상일 경우 Pass, 70점 미만이거나 전체 강의에 30% 이상 결석 시 Fail을 출력하세요.
     *
     * 예시. 1.
     *  중간고사 점수 : 80
     *  기말고사 점수 : 30
     *  과제 점수 : 60
     *  출석 횟수 : 18
     *  ====== 결과 ======
     *  중간고사 점수(20) : 16.0
     *  기말고사 점수(30) : 9.0
     *  과제 점수 (30) : 18.0
     *  출석 점수 (20) : 18.0
     *  총점 : 61.0
     *  Fail [점수 미달]
     *
     * 예시. 2.
     *  중간고사 점수 : 80
     *  기말고사 점수 : 90
     *  과제 점수 : 50
     *  출석 횟수 : 15
     *  ====== 결과 ======
     *  중간고사 점수(20) : 16.0
     *  기말고사 점수(30) : 27.0
     *  과제 점수 (30) : 15.0
     *  출석 점수 (20) : 15.0
     *  총점 : 73.0
     *  PASS
     *
     * 예시. 3.
     *  중간고사 점수 : 100
     *  기말고사 점수 : 80
     *  과제 점수 : 40
     *  출석 횟수 : 10
     *  ====== 결과 ======
     *  Fail [출석 횟수 부족 (10/20)]
     */

    /* 문제. 4.
     *  키보드로 두 개의 정수와 연산 기호를 입력 받아 연산 기호에 맞춰 연산 결과를 출력하세요.
     *  단 두 개의 정수 모두 양수일 때만 작동하며 없는 연산 기호를 입력했을시
     *  "잘못 입력하셨습니다. 프로그램을 종료합니다." 출력
     *
     * 예시.
     *  피연산자1 입력 : 15
     *  피연산자2 입력 : 4
     *  연산자를 입력(+, -, *, /, %) : /
     *  15 / 4 = 3.750000
     */

}
